function dx = P1_odefun(t,x)
% Syntax: ddyyxx = myFun(input)
% x = [x11 x12 y11 y12 t11 t12 x21 x22 y21 y22 t21 t22]
% x11 y11 t11 x21 y21 t21分别为x1,y1,t1,x2,y2,t2


% 基本参数
z1 = 55;
z2 = 75;
a = 20*pi/180;            % 压力角
m  = 2;                   % 模数
rb1 = z1*m/2*cos(a)*1e-3; % 基圆直径（m）
rb2 = z2*m/2*cos(a)*1e-3;

b = 0.15*1e-3;    % 齿侧间隙（m）

m1 = 2.034;       % 质量
m2 = 3.973;
g = 9.8;          % 重力加速度（若要忽略重力设为0即可）
I1 = 0.0033;      % 转动惯量
I2 = 0.0115;

f1 = 30;          % 输入轴频率
fm = f1*z1;       % 啮合频率
T1 = 31.9;        % 输入扭矩
T2 = 68.8;        % 输出扭矩
k1 = 2*1e8;       % 轴承支撑刚度
k2 = 2*1e8;
c1 = 900;         % 轴承支撑阻尼
c2 = 900;

% 计算
dx    = zeros(12,1);

dx(1) = x(2);
dx(2) = 1/m1*(-Fm*sin(a)-c1*x(2)-k1*x(1));

dx(3) = x(4);
dx(4) = 1/m1*(-m1*g+Fm*cos(a)-c1*x(4)-k1*x(3));

dx(5) = x(6);
dx(6) = 1/I1*(T1-rb1*Fm);

dx(7) = x(8);
dx(8) = 1/m2*(Fm*sin(a)-c2*x(8)-k2*x(7));

dx(9) = x(10);
dx(10) = 1/m2*(-m2*g-Fm*cos(a)-c2*x(10)-k2*x(9));

dx(11) =x(12);
dx(12) =1/I2*(-T2+rb2*Fm);

end